Repository: chernistry/zariz
Catalog: zariz/ios/Zariz/Resources/*.lproj/Localizable.strings
Languages: ar, he, ru

# welcome_title
source: Welcome to Zariz
ar: مرحبًا بك في ‎Zariz
he: ברוכים הבאים ל־Zariz
ru: Добро пожаловать в Zariz

# welcome_tagline
source: Courier tools for fast delivery operations.
ar: أدوات السعاة لإدارة التسليم بسرعة.
he: כלי שליחים לניהול משלוחים מהיר.
ru: Инструменты курьера для быстрой доставки.

source: Phone or email
ar: الهاتف أو البريد الإلكتروني
he: טלפון או אימייל
ru: Телефон или e-mail

# auth_login_label
source: Contact
ar: بيانات الاتصال
he: פרטי קשר
ru: Контакт

source: Role
ar: الدور
he: תפקיד
ru: Роль

# role_courier
source: Courier
ar: مندوب
he: שליח
ru: Курьер

# role_store
source: Store
ar: متجر
he: סניף
ru: Точка

# role_admin
source: Admin
ar: مسؤول
he: מנהל
ru: Админ

source: Demo mode
ar: وضع العرض
he: מצב הדגמה
ru: Демо-режим

# demo_hint
source: In demo mode sign in with courier, store or admin.
ar: في وضع العرض استخدم courier أو store أو admin.
he: במצב הדגמה השתמש ב־courier, store או admin.
ru: В демо используйте courier, store или admin.

source: Sign in
ar: تسجيل الدخول
he: התחברות
ru: Войти

# auth_password_label
source: Password
ar: كلمة المرور
he: סיסמה
ru: Пароль

# password_placeholder
source: Password
ar: كلمة المرور
he: סיסמה
ru: Пароль

# forgot_password_cta
source: Forgot password? Contact ops@zariz
ar: نسيت كلمة المرور؟ راسل ops@zariz
he: שכחתם סיסמה? פנו ל־ops@zariz
ru: Забыли пароль? Напишите на ops@zariz

# auth_error_identifier_required
source: Please enter email or phone
ar: يرجى إدخال البريد أو الهاتف
he: הזינו אימייל או טלפון
ru: Введите e-mail или телефон

# auth_error_password_short
source: Password must be at least 8 characters
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل
he: סיסמה חייבת להכיל לפחות 8 תווים
ru: Пароль должен быть не короче 8 символов

# auth_hero_title
source: Stay on top of every run
ar: تابع كل الطلبات
he: כל ההזמנות בשליטה
ru: Держите заказы под контролем

# auth_hero_subtitle
source: Track pickups, claims and delivery state in real time.
ar: راقب الاستلام والتسليم والحالة فورًا.
he: עקבו אחרי איסוף, קבלה ומשלוח בזמן אמת.
ru: Отслеживайте забор, принятие и доставку в реальном времени.

# auth_hero_badge
source: 24/7 dispatch
ar: تشغيل 24/7
he: משמרת 24/7
ru: 24/7 диспетчер

source: Orders
ar: الطلبات
he: הזמנות
ru: Заказы

# orders_hero_title
source: Monitor live orders
ar: طلبات مباشرة
he: הזמנות חיות
ru: Живые заказы

# orders_hero_subtitle
source: Swipe through queues and claim what is next.
ar: تصفية قوائم الانتظار واستلام الطلب التالي.
he: מסננים תורים ותופסים את ההזמנה הבאה.
ru: Фильтруйте очереди и берите следующий заказ.

# orders_summary_total
source: Today
ar: اليوم
he: היום
ru: Сегодня

# orders_summary_new
source: New
ar: جديدة
he: חדשות
ru: Новые

# orders_summary_active
source: Active
ar: قيد العمل
he: פעילות
ru: В работе

source: Profile
ar: الملف الشخصي
he: פרופיל
ru: Профиль

# profile_title
source: Your profile
ar: ملفك
he: הפרופיל שלך
ru: Ваш профиль

# profile_real_role
source: Authenticated session
ar: جلسة موثوقة
he: משתמש מחובר
ru: Авторизованная сессия

# profile_demo_role
source: Demo account
ar: حساب عرض
he: חשבון הדגמה
ru: Демо-аккаунт

# profile_tagline
source: Manage delivery preferences and keep access secure.
ar: اضبط تفضيلات التسليم وحافظ على الأمان.
he: נהלו העדפות משלוח ושמרו על הגישה.
ru: Настройте доставку и защитите доступ.

# profile_demo_hint
source: Demo mode keeps data offline. Connect to the backend for live orders.
ar: في وضع العرض تبقى البيانات محليًا. اتصل بالخادم للطلبات الحية.
he: במצב הדגמה הנתונים נשארים מקומית. התחברו לשרת להזמנות חיות.
ru: В демо данные остаются локально. Подключитесь к серверу для живых заказов.

# profile_logout_title
source: Sign out
ar: تسجيل الخروج
he: יציאה
ru: Выход

# profile_logout_subtitle
source: Clears the saved token and returns to sign in.
ar: يمسح الرمز ويعيدك إلى شاشة الدخول.
he: מנקה את האסימון ושב למסך ההתחברות.
ru: Удаляет токен и возвращает к входу.

source: Log out
ar: تسجيل الخروج
he: יציאה
ru: Выйти

# language_picker
source: Change language
ar: تغيير اللغة
he: שינוי שפה
ru: Сменить язык

# language_picker_title
source: Choose language
ar: اختر اللغة
he: בחרו שפה
ru: Выберите язык

# filter_new
source: New
ar: جديدة
he: חדשות
ru: Новые

# filter_active
source: Active
ar: قيد العمل
he: פעילות
ru: Активные

# filter_done
source: Done
ar: مكتملة
he: הושלם
ru: Выполнено

# no_orders_title
source: No orders yet
ar: لا توجد طلبات
he: אין הזמנות
ru: Заказов нет

# no_orders_subtitle
source: Pull to refresh or check back soon.
ar: اسحب للتحديث أو حاول لاحقًا.
he: משכו לרענון או נסו שוב מאוחר יותר.
ru: Потяните, чтобы обновить, или зайдите позже.

source: Order
ar: طلب
he: הזמנה
ru: Заказ

source: Pickup
ar: الاستلام
he: איסוף
ru: Забор

source: Delivery
ar: التسليم
he: משלוח
ru: Доставка

# order_status_header
source: Progress
ar: التقدم
he: התקדמות
ru: Прогресс

source: Claim
ar: استلام
he: קבל
ru: Взять

source: Picked up
ar: تم الالتقاط
he: נאסף
ru: Забрал

source: Delivered
ar: تم التسليم
he: נמסר
ru: Доставил

# invalid_demo_login
source: Enter courier, store or admin to continue.
ar: أدخل courier أو store أو admin.
he: הזינו courier, store או admin.
ru: Введите courier, store или admin.

# status_new
source: New
ar: جديد
he: חדש
ru: Новый

# status_claimed
source: Claimed
ar: تم الاستلام

# status_picked_up
source: Picked
ar: تم الالتقاط
he: נאסף
ru: Забран

# status_delivered
source: Delivered
ar: تم التسليم
he: נמסר
ru: Доставлен

# status_canceled
source: Canceled
ar: أُلغي
he: בוטל
ru: Отменён

source: Cancel
ar: إلغاء
he: ביטול
ru: Отмена

# toast_claimed
source: Order claimed
ar: تم استلام الطلب

# toast_picked_up
source: Order picked up
ar: تم التقاط الطلب
he: ההזמנה נאספה
ru: Заказ забран

# toast_delivered
source: Order delivered
ar: تم تسليم الطلب
he: ההזמנה נמסרה
ru: Заказ доставлен

# toast_generic_error
source: Something went wrong. Try again.
ar: حدث خطأ، حاول مرة أخرى.
he: אירעה שגיאה. נסו שוב.
ru: Ошибка. Попробуйте снова.

source: Slide to claim
ar: اسحب للتعيين
he: החלק כדי לשייך
ru: Свайпните, чтобы принять

source: Slide to pick up
ar: اسحب للاستلام
he: החלק כדי לאסוף
ru: Свайпните, чтобы забрать

source: Slide to deliver
ar: اسحب للتسليم
he: החלק למסירה
ru: Свайпните, чтобы доставить

source: Release to confirm
ar: حرر للتأكيد
he: שחררו לאישור
ru: Отпустите для подтверждения

# store_tab_home
source: Store
ar: المتجر
he: חנות
ru: Магазин

# store_tab_orders
source: Orders
ar: الطلبات
he: הזמנות
ru: Заказы

# store_home_title
source: Store dashboard
ar: لوحة المتجر
he: לוח החנות
ru: Панель магазина

# store_home_subtitle
source: Create delivery orders
ar: إنشاء شحنات جديدة
he: יצירת הזמנות משלוח
ru: Создание доставок

# store_home_hint
source: Keep recipient contact and boxes count updated before dispatch.
ar: تأكد من تحديث بيانات المستلم وعدد الصناديق قبل الإرسال.
he: דאגו לעדכן פרטי נמען וכמות ארגזים לפני השליחה.
ru: Перед отправкой заполните контакты получателя и число коробок.

# store_pricing_single
source: Up to 8 boxes · single delivery (35₪)
ar: حتى ٨ صناديق · توصيل واحد (35₪)
he: עד 8 ארגזים · משלוח בודד (35₪)
ru: До 8 коробок · один рейс (35₪)

# store_pricing_double
source: 9–16 boxes · double delivery (70₪)
ar: ٩–١٦ صندوقًا · توصيل مزدوج (70₪)
he: 9–16 ארגזים · משלוח כפול (70₪)
ru: 9–16 коробок · двойной рейс (70₪)

# store_pricing_triple
source: 17+ boxes · triple delivery (105₪)
ar: ١٧+ صندوقًا · توصيل ثلاثي (105₪)
he: 17+ ארגזים · משלוח משולש (105₪)
ru: 17+ коробок · тройной рейс (105₪)

# store_home_create
source: Create new order
ar: إنشاء طلب جديد
he: יצירת הזמנה חדשה
ru: Создать заказ

# store_home_recent_link
source: Recent orders
ar: الطلبات الأخيرة
he: הזמנות אחרונות
ru: Последние заказы

# store_home_pickup_format
source: Pickup address: %@
ar: عنوان الاستلام: %@
he: כתובת איסוף: %@
ru: Адрес забора: %@

# store_home_pending_title
source: Waiting to sync
ar: بانتظار المزامنة
he: מחכה לסנכרון
ru: Ожидает отправки

# store_home_pending_description
source: We will submit %d pending order(s) when back online.
ar: سيتم إرسال %d طلبًا عند عودة الاتصال.
he: %d הזמנות יישלחו כשיתחדש החיבור.
ru: %d заказ(ов) будет отправлен при появлении сети.

# store_home_recent_header
source: Latest submissions
ar: آخر الطلبات
he: הזמנות שנשלחו לאחרונה
ru: Недавние отправки

# store_orders_title
source: Orders
ar: الطلبات
he: הזמנות
ru: Заказы

# store_orders_empty
source: No orders yet. Pull to refresh.
ar: لا توجد طلبات بعد. اسحب للتحديث.
he: אין הזמנות כרגע. גררו לרענון.
ru: Пока нет заказов. Потяните для обновления.

# store_new_order_title
source: New order
ar: طلب جديد
he: הזמנה חדשה
ru: Новый заказ

# store_new_order_pickup
source: Pickup
ar: استلام
he: איסוף
ru: Забор

# store_new_order_pickup_placeholder
source: Warehouse or pickup location
ar: المستودع أو عنوان الاستلام
he: מחסן או כתובת איסוף
ru: Склад или адрес забора

# store_new_order_recipient
source: Recipient
ar: المستلم
he: נמען
ru: Получатель

# store_new_order_first_name
source: First name
ar: الاسم الأول
he: שם פרטי
ru: Имя

# store_new_order_last_name
source: Last name
ar: اسم العائلة
he: שם משפחה
ru: Фамилия

# store_new_order_phone
source: Phone
ar: هاتف
he: טלפון
ru: Телефон

# store_new_order_address
source: Delivery address
ar: عنوان التوصيل
he: כתובת משלוח
ru: Адрес доставки

# store_new_order_street
source: Street
ar: الشارع
he: רחוב
ru: Улица

# store_new_order_building
source: Building number
ar: رقم المبنى
he: מספר בית
ru: Дом

# store_new_order_floor
source: Floor
ar: الطابق
he: קומה
ru: Этаж

# store_new_order_apartment
source: Apartment
ar: الشقة
he: דירה
ru: Квартира

# store_new_order_boxes
source: Boxes
ar: صناديق
he: ארגזים
ru: Коробки

# store_new_order_boxes_count
source: %d box(es)
ar: %d صندوقًا
he: %d ארגזים
ru: %d коробок

# store_new_order_price_hint
source: Estimated charge: %d₪
ar: التكلفة التقديرية: %d₪
he: עלות משוערת: %d₪
ru: Расчетная стоимость: %d₪

# store_new_order_submit
source: Submit order
ar: إرسال الطلب
he: שליחת הזמנה
ru: Отправить заказ

# store_new_order_success
source: Order submitted
ar: تم إرسال الطلب
he: ההזמנה נשלחה
ru: Заказ отправлен

# store_new_order_offline
source: Saved offline and will sync later
ar: حُفظ بدون اتصال وسيُرسل لاحقًا
he: נשמר במצב אופליין ויסתנכרן מאוחר יותר
ru: Сохранено офлайн и отправится позже

# store_new_order_error
source: Unable to submit order
ar: تعذر إرسال الطلب
he: לא ניתן לשלוח הזמנה
ru: Не удалось отправить заказ

# order_row_boxes
source: %d boxes
ar: %d صندوقًا
he: %d ארגזים
ru: %d коробок

# order_recipient_header
source: Recipient details
ar: بيانات المستلم
he: פרטי נמען
ru: Данные получателя

# order_boxes_header
source: Delivery summary
ar: ملخص التوصيل
he: סיכום משלוח
ru: Сводка доставки

# order_boxes_count
source: Boxes: %d
ar: الصناديق: %d
he: ארגזים: %d
ru: Коробки: %d

# order_boxes_multiplier
source: Multiplier: x%d
ar: المضاعف: ‎x%d
he: מקדם: x%d
ru: Коэффициент: x%d

# order_price_total
source: Estimated price: %.0f₪
ar: التكلفة التقديرية: %.0f₪
he: עלות משוערת: %.0f₪
ru: Расчетная стоимость: %.0f₪

# orders_service_unavailable
source: Order creation is unavailable for this role.
ar: إنشاء الطلب غير متاح لهذا الدور.
he: יצירת הזמנה אינה זמינה עבור תפקיד זה.
ru: Создание заказа недоступно для этой роли.

# orders_service_server_error
source: Server error (%d).
ar: خطأ في الخادم (%d).
he: שגיאת שרת (%d).
ru: Ошибка сервера (%d).

# orders_service_unknown_error
source: Unknown error.
ar: خطأ غير معروف.
he: שגיאה לא ידועה.
ru: Неизвестная ошибка.
